<?php
include './connectDatabase/connectDB.php';
$teacher = [
    "อาจารย์ทุกท่าน",
    "รศ.ดร.ศาสตรา   วงศ์ธนวสุ",
    "รศ.ดร.สิรภัทร   เชี่ยวชาญวัฒนา",
    "รศ.ดร.ปัญญาพล   หอระตะ",
    "ผศ.ดร.พุธษดี   ศิริแสงตระกูล",
    "ผศ.ดร.สันติ   ทินตะนัย",
    "ผศ.ดร.คำรณ   สุนัติ",
    "ผศ.ดร.ชิตสุธา   สุ่มเล็ก",
    "ผศ.ดร.บุญทรัพย์   ไวคำ",
    "ผศ.ดร.สิลดา   อินทรโสธรฉันท์",
    "ผศ.ดร.อุรฉัตร   โคแก้ว",
    "อาจารย์ วชิราวุธ   ธรรมวิเศษ",
    "อาจารย์ ธนพล   ตั้งชูพงศ์",
    "อาจารย์ ไพรสันต์   ผดุงเวียง",
    "รศ.ดร.สมจิตร   อาจอินทร์",
    "รศ.ดร.งามนิจ   อาจอินทร์",
    "รศ.ดร.จักรชัย   โสอินทร์",
    "ผศ.ดร.ปวีณา   วันชัย",
    "ผศ.ดร.สายยัญ   สายยศ",
    "ผศ.ดร.สุมณฑา   เกษมวิลาศ",
    "ผศ.ดร.วรารัตน์   สงฆ์แป้น",
    "ผศ.ดร.มัลลิกา   วัฒนะ",
    "อาจารย์ รภัสสิทธิ์   ชินภัทรจีรัสถ์",
    "อาจารย์ วรัญญา   วรรณศรี",
    "อาจารย์ เพชร    อิ่มทองคำ",
    "อาจารย์ ชานนท์   เดชสุภา",
    "รองศาสตราจารย์   ชัยพล   กีรติกสิกร",
    "ผู้ช่วยศาสตราจารย์   รัศมี   สุวรรณวีระกำธร",
    "ผู้ช่วยศาสตราจารย์   พิพัธน์   เรืองแสง",
    "ผู้ช่วยศาสตราจารย์   อุราวรรณ   จันทร์เกษ",
    "ผู้ช่วยศาสตราจารย์   ณกร   วัฒนกิจ",
    "อาจารย์   ศรัณย์   อภิชนตระกูล",
    "อาจารย์   ศักดิ์พจน์   ทองเลี่ยมนาค",
];

foreach ($teacher as &$value) {
    $sql = "INSERT INTO teacher(teacher_name) VALUES ('$value')";
    mysqli_query($conn,$sql);
}
